export const about = {
    "title": "نبذة عني",
    "description": "رائد أعمال ومهندس سوري-برازيلي لديه شغف ببناء الجسور بين الثقافات والتقنيات والقارات. نقلتني مسيرتي المهنية من تطوير حلول التشفير لسلاح الجو البرازيلي إلى توسيع منصات التجارة الإلكترونية في أوروبا، مما منحني منظوراً فريداً في تطوير تكنولوجيا مؤثرة",
    "professionalJourney": {
        "title": "رحلتي مهنية",
        "content": [
            "بدأت مسيرتي المهنية في قطاع الصناعات الدفاعية في البرازيل، حيث عملت على نظام تشفير طورته شركة تكنولوجيا دفاعية لصالح القوات الجوية البرازيلية. مهدت هذه الخبرة التأسيسية في مجال الأمن والدقة الطريق لتوسعي في مجال التكنولوجيا.",
            "من تحسين نماذج التعلم الآلي لشركات في الولايات المتحدة إلى توسيع منصات تجارة الإلكترونية في أوروبا، لقد احتضنت التحديات التي تتطلب العمق التقني والفهم الثقافي.",
            "أسستُ شركة Zaitech للإستثمار في هذه الخبرة العالمية، حيث أقدم الاستشارات والإرشاد لمساعدة المهندسين والشركات على بناء حلول تلقى صدى في أسواق متنوعة."
        ]
    },
    "achievements": [
        {
            "icon": "trending-up",
            "title": "رفع الإيرادات",
            "description": "منصات حققت إيرادات بعشرات الملايين، مما أدى إلى نمو الأعمال وريادة السوق."
        },
        {
            "icon": "users",
            "title": "قيادة الفرق",
            "description": "نجحت في قيادة وإرشاد فرق عمل متنوعة في أكثر من أربع دول، مما عزز ثقافة التعاون والابتكار."
        },
        {
            "icon": "smartphone",
            "title": "إطلاق وتوسيع منصة",
            "description": "أنظمة تم تصميمها وتوسيع نطاقها من عدد قليل من الأجهزة إلى أكثر من 230,000 وحدة نشطة، مع ضمان الموثوقية والأداء."
        },
        {
            "icon": "graduation-cap",
            "title": "الإرشاد",
            "description": "انطلاقاً من شغفي بتمكين الجيل القادم من المهندسين، فقد قمتُ بتوجيه أكثر من 50 مهندساً من خلال برامج التدريب والتطوير"
        }
    ]
};
