export const education = {
  "degree": "هندسة الروبوتات والتحكم والأتمتة",
  "institution": "جامعة برازيليا",
  "location": "برازيليا، البرازيل",
  "researchFocus": {
    "title": "التركيز البحثي",
    "description": "تخصصت في الأنظمة الفوضوية والاتصالات الآمنة، مع بحث منشور حول 'مزامنة نظام Sprott-k الفوضوي غير المشغل القائم على التحكم النسبي مع كسب متغير' في المؤتمر البرازيلي للأوتوماتيكية."
  },
  "teachingExperience": {
    "title": "الخبرة التعليمية",
    "description": "عملت كمساعد أستاذ (مراقب) لمواد رئيسية بما في ذلك مختبر الدوائر الكهربائية، وبرمجة الحاسوب والخوارزميات، وحساب التفاضل والتكامل. قمت بتوجيه وإرشاد طلاب البكالوريوس من 2016 إلى 2018، مما عزز نموهم الأكاديمي."
  }
};
