export const education = {
  "degree": "هندسة الروبوتات والتحكم والأتمتة",
  "institution": "جامعة برازيليا الفيدرالية",
  "location": "برازيليا، البرازيل",
  "researchFocus": {
    "title": "تركيز البحث",
    "description": "متخصص في الأنظمة الفوضوية والاتصالات السلكية واللاسلكية الآمنة، مع بحث منشور حول \"مزامنة نظام Sprott-k الفوضوي غير المتفاعل القائم على التحكم التناسبي مع كسب متغير\" في المؤتمر البرازيلي للأتمتة."
  },
  "teachingExperience": {
    "title": "الخبرة في التدريس",
    "description": "شغل منصب أستاذ مساعد (مراقب) للمواد الرئيسية بما في ذلك مختبر الدوائر الكهربائية، وبرمجة الحاسوب والخوارزميات، وحساب التفاضل والتكامل. قام بإرشاد وتوجيه طلاب المرحلة الجامعية من 2016 إلى 2018، مما عزز نموهم الأكاديمي."
  }
};