export const experience = {
  "title": "الخبرات المهنية",
  "description": "سجل حافل في تقديم حلول قابلة للتطوير وذات تأثير كبير في مختلف الصناعات والأسواق العالمية.",
  "items": [
    {
      "id": "zaitech",
      "title": "مؤسس",
      "company": "Zaitech",
      "location": "كل العالم",
      "period": "2021 – present",
      "description": "أسست وأدير شركة Zaitech، وهي شركة تقنية لتطوير البرمجيات باستخدام تقنيات متعددة مثل Kotlin وKotlin Multiplatform (KMP) وGolang وRust. أتولى قيادة جميع ارتباطات العملاء بدءاً من تحديد النطاق الأولي وحتى التسليم.  نقوم بتصميم منصات فعالة للتجارة الإلكترونية - معالجة المدفوعات - تطبيقات الجوال - الواجهات الخلفية التي تمكّن الشركات من الوصول إلى أهدافها.",
      "skills": ["ريادة الأعمال", "هندسة البرمجيات", "Kotlin", "KMP", "Golang", "Rust", "الأنظمة السحابية", "الاستشارات"],
      "color": "primary"
    },
    {
      "id": "asml",
      "title": "مهندس برمجيات أول",
      "company": "ASML",
      "location": "أيندهوفن، هولندا",
      "period": "2021/10 – 2022/11",
      "description": "قللت وقت إعداد الماكينة بمقدار ثماني ساعات من خلال إعادة هندسة -إجراءات المعايرة والأداء- لاستخدام ملفات البيانات التي تم إعدادها مسبقًا بدلاً من المعايرة اليدوية من البداية. تطلبت هذه المبادرة تعاونًا مكثفًا مع العديد من الشركات و المسؤولين لضمان التكامل و التوافق.",
      "skills": ["Python", "C++", "اختبار الوحدة", "التوثيق"],
      "color": "accent"
    },
    {
      "id": "xebia",
      "title": "استشاري أول",
      "company": "Xebia",
      "location": "",
      "period": "",
      "description": "أدرت فريق مكون من أربعة مطوري برمجيات لتصميم وتطوير وصيانة منصة للتجارة الإلكترونية لدعم شركة بيع بالتجزئة هولندية كبرى. وتحت قيادتي، عالجت المنصة مئات الآلاف من الطلبات، وحققت إيرادات بعشرات الملايين، وتوسعت إلى بلجيكا، لتصبح نظامًا متعدد اللغات ومتعدد البلدان.",
      "skills": ["التجارة الإلكترونية", "Golang", "GCP", "القيادة", "التوسع الدولي"],
      "color": "primary"
    },
    {
      "id": "stone",
      "title": "مهندس برمجيات أول",
      "company": "Stone",
      "location": "ريو دي جانيرو، البرازيل",
      "period": "2019/11 – 2021/10",
      "description": "قدت عملية توسع منتج رئيسي من أقل من عشرة أجهزة إلى أكثر من 230,000 جهاز عميل نشط. تضمنت مسؤولياتي تنفيذ Pipelines CI/CD، وربط أنظمة الشركات المصنعة للأجهزة. وتطوير خدمات مراقبة لضمان الموثوقية والأداء على نطاق واسع. كما شاركت بشكل كبير في تطوير ودمج نظام PIX (نظام الدفع الفوري البرازيلي) في المنصة، مما عزز سرعة المعاملات وتجربة المستخدم.",
      "skills": ["Kotlin", "أنظمة الدفع", "أندرويد", "الهندسة المعمارية", "الكوروتينات", "المرونة"],
      "color": "primary"
    },
    {
      "id": "core",
      "title": "مطور برمجيات",
      "company": "Core Consulting",
      "location": "برازيليا، البرازيل",
      "period": "2019/04 – 2019/11",
      "description": "حللت اختناقات المعالجة والعرض للسجلات الصحية الإلكترونية، مما قلل من وقت المعالجة بنسبة 50%. تم تحقيق ذلك من خلال إعادة هيكلة التطبيق للاستفادة من Promises JavaScript والتنسيق مع فريق الواجهة الخلفية لتحسين تنظيم الصفحات. أيضا نفذت معايير FHIR باستخدام HAPI في بيئة Spring Boot Kotlin.",
      "skills": ["React Native", "جافا سكريبت", "FHIR", "سبرينغ بوت"],
      "color": "primary"
    },
    {
      "id": "z-tech",
      "title": "مهندس برمجيات مدمجة",
      "company": "Z-Tecnologia",
      "location": "برازيليا، البرازيل",
      "period": "2018/01 – 2019/04",
      "description": " طورت وتنفذت اختبارات آلية وميزات جديدة لشريحة تشفير مصممة للاستخدام في أي جهاز حديث. وكان العميل الرئيسي لهذا المنتج عالي الأمان هو القوات الجوية البرازيلية.",
      "skills": ["C++", "الصناعة الدفاعية", "الأنظمة المدمجة", "التشفير"],
      "color": "accent"
    }
  ]
};