{
  "title": "Professional Experience",
  "description": "A track record of delivering scalable solutions across diverse industries and technologies",
  "items": [
    {
      "id": "xebia",
      "title": "Senior Consultant",
      "company": "Xebia",
      "location": "Utrecht, Netherlands",
      "period": "2022/11 – Present",
      "description": "Leading a team of four software developers, responsible for the design, development, and maintenance of the ecommerce platform of a big Dutch retailer. Since I started as the Senior Consultant, the platform has processed hundreds of thousands of orders, generating tens of millions in revenue. Expanded the platform beyond the Netherlands to include Belgium, transforming it into a multi-lingual, multi-country system.",
      "skills": ["E-Commerce", "Golang", "GCP", "Leadership", "International Expansion"],
      "color": "primary"
    },
    {
      "id": "asml",
      "title": "Lead Software Engineer",
      "company": "ASML",
      "location": "Eindhoven, Netherlands",
      "period": "2021/10 – 2022/11",
      "description": "Reduced eight hours of the time it takes the machine to be ready for production by adapting machine calibration & performance procedures to receive data from a ready file instead of running manual calibration from zero. Collaborated with multiple stakeholders to achieve significant alignments and agreements.",
      "skills": ["Python", "C++", "Unit Testing", "Documentation"],
      "color": "accent"
    },
    {
      "id": "stone",
      "title": "Lead Software Engineer",
      "company": "Stone",
      "location": "Rio de Janeiro, Brazil",
      "period": "2019/11 – 2021/10",
      "description": "Scaled a product from less than ten devices to +230k devices actively used by clients. Implemented CI pipelines, integrated new manufacturers, and developed monitoring services. Led the team responsible for introducing Android-based POS to the market and scaling it effectively.",
      "skills": ["Kotlin", "Android", "Architecture", "Coroutines", "Agile"],
      "color": "primary"
    },
    {
      "id": "penguin",
      "title": "Consultant Software Engineer",
      "company": "PenguinIN",
      "location": "Irvine, California, USA",
      "period": "2020/09 – 2021/09",
      "description": "Optimized the position-detection system time response to take one-quarter of the original time by developing a production-grade machine learning backend service from scratch to substitute the old asp.net system.",
      "skills": ["Python", "Machine Learning", "Flask", "Docker", "DevOps"],
      "color": "accent"
    },
    {
      "id": "core",
      "title": "Software Developer",
      "company": "Core Consulting",
      "location": "Brasilia, Brazil",
      "period": "2019/04 – 2019/11",
      "description": "Solved parallel parsing and rendering issues for health records, reducing processing time by at least half. Refactored application to use JavaScript promises and coordinated with backend team on pagination and request optimization. Implemented FHIR using HAPI in Spring Boot Kotlin.",
      "skills": ["React Native", "JavaScript", "FHIR", "Spring Boot"],
      "color": "primary"
    },
    {
      "id": "z-tech",
      "title": "Embedded Software Engineer",
      "company": "Z-Tecnologia",
      "location": "Brasilia, Brazil",
      "period": "2018/01 – 2019/04",
      "description": "Implemented automated tests and added new features for the hardware which was a cryptographic chip that could be used in any device that has an SD card slot, the main client of this product was the Brazilian Air Force.",
      "skills": ["C++", "Embedded Systems", "Cryptography", "Testing"],
      "color": "accent"
    }
  ]
}
